[
  {
    "id": "bd6e32d4-2639-4817-be25-9f6f3777bfdd",
    "name": "Dauphinoise Potatoes",
    "time_minutes": "45",
    "difficulty": "easy",
    "description": "A classic French side dish featuring thinly sliced potatoes baked in a savory garlic-infused cream sauce and topped with melted Gruyere cheese.",
    "ingredients_available": "Salt",
    "ingredients_needed": "2 lbs russet or Yukon Gold potatoes, 2 cups heavy cream, 3 cloves garlic (minced), 1.5 cups shredded Gruyere cheese, 2 tbsp butter",
    "instructions": "1. Preheat your oven to 325°F and grease a 9x13 inch baking dish with butter.\n2. Peel and slice the potatoes into 1/8-inch thick rounds.\n3. In a large saucepan, combine the heavy cream, minced garlic, salt, and sliced potatoes.\n4. Bring the mixture to a light simmer over medium heat, then immediately remove from the burner.\n5. Transfer the potato and cream mixture into the prepared baking dish, spreading them into even layers.\n6. Sprinkle the shredded Gruyere cheese evenly over the top.\n7. Bake at 325°F for approximately 30 to 35 minutes, or until the potatoes are tender and the top is golden brown.",
    "reason": "From your weekly plan • Captured recipe"
  },
  {
    "id": "d8ed3f6d-591f-4944-ac3b-32480d62324b",
    "name": "Eggplant Parmesan",
    "time_minutes": 90,
    "difficulty": "medium",
    "description": "This lighter take on the classic Italian dish uses oven-baked breaded eggplant slices instead of deep-frying to reduce grease and prep time while maintaining a crisp texture.",
    "ingredients_available": "",
    "ingredients_needed": "2 pounds eggplant (sliced into 1/4-inch-thick rounds), 1 1/2 teaspoons kosher salt (for draining eggplant), 1/2 teaspoon black pepper, 8 slices hearty white sandwich bread (torn into quarters), 2 ounces Parmesan cheese, grated (1 cup), 1 cup all-purpose flour, 1 teaspoon black pepper (for flour mixture), 4 large eggs, 6 tablespoons vegetable oil, 3 cans (14.5-ounce) diced tomatoes, 2 tablespoons extra-virgin olive oil, 4 cloves garlic (minced), 1/4 teaspoon red pepper flakes, 1/4 cup fresh basil (chopped), 1/2 teaspoon kosher salt (for sauce, to taste), 1/2 teaspoon black pepper (for sauce, to taste), 8 ounces mozzarella cheese (shredded, 2 cups), 1 ounce Parmesan cheese, grated (1/2 cup), 10 leaves fresh basil (roughly torn)",
    "instructions": "1. Toss sliced eggplant with 1 1/2 teaspoons salt in a colander and let drain for 30 to 45 minutes until about 2 tablespoons of liquid is released. Wipe excess salt away, spread on paper towels, and pat thoroughly dry.\n2. Adjust oven racks to upper-middle and lower-middle positions, place a rimmed baking sheet on each rack, and preheat oven to 425 degrees.\n3. Pulse 8 slices of bread in a food processor (about 15 pulses) until you have 4 cups of fine crumbs. Transfer to a shallow dish and stir in 1 cup grated Parmesan and 1/2 teaspoon pepper.\n4. Combine 1 cup flour and 1 teaspoon pepper in a large zipper-lock bag. Beat 4 eggs in a second shallow dish.\n5. Working with 8 to 10 eggplant slices at a time, shake in the flour bag to coat, dip in eggs, and then coat with the bread-crumb mixture. Transfer to a wire rack set in a separate baking sheet.\n6. Remove preheated sheets from the oven. Add 3 tablespoons oil to each sheet, tilting to coat. Place eggplant on sheets in a single layer and bake for about 30 minutes, rotating sheets after 10 minutes and flipping slices after 20 minutes.\n7. For the sauce: Process 2 cans of diced tomatoes in the food processor for 5 seconds. Heat 2 tablespoons olive oil, 4 minced garlic cloves, and 1/4 teaspoon red pepper flakes in a saucepan over medium-high heat for 3 minutes.\n8. Stir in the processed tomatoes and the 1 remaining can of diced tomatoes. Bring to a boil, then reduce to a simmer and cook for about 15 minutes until reduced to 4 cups. Remove from heat and stir in 1/4 cup chopped basil; season with salt and pepper.\n9. Spread 1 cup sauce over the bottom of a 13 by 9-inch baking dish. Layer half of the eggplant slices, overlapping to fit. Top with 1 cup sauce and 1 cup mozzarella.\n10. Layer remaining eggplant into the dish. Dot with 1 cup sauce (leaving most eggplant exposed to stay crisp). Sprinkle with 1/2 cup Parmesan and the remaining 1 cup mozzarella.\n11. Bake until sauce is bubbling and cheese is browned, 13 to 15 minutes. Let cool for 10 minutes, sprinkle with 10 torn basil leaves, and serve with any remaining sauce.",
    "reason": "From your weekly plan • Captured recipe"
  }
]