[
  {
    "name": "Autumn Root Vegetable Roast with Cabbage over Herbed Couscous",
    "description": "A hearty medley of roasted root vegetables, squash, and caramelized cabbage served over a bed of fluffy couscous. This vegetarian dish features a balsamic-herb glaze that ties the earthiness of the vegetables together.",
    "ingredients_available": "1 bunch Red Turnips, 1 unit Green Meat Radish, 1 unit Bordeaux Radish, 1 bunch Carrots, 1 unit Delicata Squash, 1 lb German Butterball Potatoes, 1 bunch Japanese Negi Scallions, 1 bunch Parsley",
    "ingredients_needed": "1/2 head Green Cabbage, 1.5 cups Dry Pearl Couscous, 3 tbsp Olive Oil, 1 tsp Salt, 0.5 tsp Black Pepper, 1 tsp Dried Thyme, 2 tbsp Balsamic Vinegar, 1.5 cups Water",
    "time_minutes": "55",
    "difficulty": "easy",
    "reason": "Added 1/2 head of cabbage to the roast for texture and chose couscous as the base to provide a light, fluffy contrast to the dense root vegetables.",
    "instructions": "1. Preheat oven to 400°F (200°C).\n2. Scrub and dice 1 lb German Butterball Potatoes and 1 bunch Carrots into 1-inch chunks. Slice 1 unit Delicata Squash in half, remove seeds, and cut into 1/2-inch half-moons.\n3. Quarter 1 bunch Red Turnips, and dice 1 unit Green Meat Radish and 1 unit Bordeaux Radish into 1-inch cubes.\n4. Toss the potatoes, carrots, squash, turnips, and radishes on a large sheet pan with 3 tbsp Olive Oil, 1 tsp Salt, 0.5 tsp Black Pepper, and 1 tsp Dried Thyme.\n5. Roast for 20 minutes. While roasting, cut 1/2 head Green Cabbage into 1-inch thick wedges or ribbons.\n6. Remove the pan from the oven, add the cabbage wedges, and toss gently. Return to the oven for 10 minutes.\n7. Slice 1 bunch Japanese Negi Scallions into 1-inch pieces. Add them to the sheet pan and roast for a final 10 minutes (40 minutes total roasting time).\n8. While vegetables finish, bring 1.5 cups Water to a boil in a small pot. Add 1.5 cups Dry Pearl Couscous, cover, remove from heat, and let sit for 5 minutes (or follow package instructions until tender).\n9. Fluff the couscous with a fork and stir in 1/2 cup chopped fresh Parsley.\n10. Serve the roasted vegetables and cabbage over the couscous, finishing with a drizzle of 2 tbsp Balsamic Vinegar.",
    "id": "1a5aae3e-cdb6-4a0d-934d-dfeb7fe06294"
  }
]