{
  "last_updated": "2025-12-24T15:01:25.479180",
  "recipes": [
    {
      "name": "Spicy Vegetarian Sopa Azteca (Tortilla Soup) with Ancho, Pasilla & Guajillo Chiles",
      "time_minutes": 60,
      "difficulty": "medium",
      "cuisine": null,
      "rating": 5,
      "last_made": "2025-11-30",
      "ingredients": [
        "2 tablespoons Extra Virgin Olive Oil",
        "4 cups tomatoes (diced)",
        "6 cups vegetable broth",
        "1 onion (diced)",
        "4 cloves garlic (minced)",
        "2-3 ancho chiles",
        "1-2 pasilla chiles",
        "2 guajillo chiles",
        "2-3 Serrano peppers (sliced)",
        "4 corn tortillas",
        "1½ cups corn kernels",
        "1 avocado (sliced)",
        "3 tablespoons fresh cilantro",
        "3 tablespoons fresh recao",
        "1 lime",
        "salt",
        "pepper"
      ],
      "notes": "We added black beans which gave it a bit of depth. Don’t forget to de-seed the chilis and watch the heat",
      "type": null,
      "times_made": null,
      "id": "83923ded-2300-4b71-b0c8-aeeba83c10d0",
      "source": "Loved",
      "created_date": "2025-11-30T11:24:14.348342",
      "cook_count": 0,
      "tags": [
        "vegetarian"
      ]
    },
    {
      "name": "Spicy Mushroom and Spinach Curry",
      "description": "A rich and fiery Indian curry featuring tender mushrooms and wilted spinach in a creamy tomato-based sauce with aromatic spices. Perfect for those who love bold, spicy flavors.",
      "ingredients_available": "None",
      "ingredients_needed": "Mushrooms (16 oz), fresh spinach (4 cups), onions (2 medium), tomatoes (3 medium), fresh ginger (2-inch piece), garlic (6 cloves), fresh cilantro (1/4 cup), heavy cream or coconut milk (1/2 cup)",
      "time_minutes": "35",
      "difficulty": "easy",
      "reason": "Directly matches your request for a spicy Indian curry while incorporating mushrooms for hearty texture.",
      "instructions": "1. Dice 2 medium onions, mince 6 garlic cloves and 2-inch piece of ginger, chop 3 tomatoes, and slice 16 oz mushrooms.\n2. Heat 2 tablespoons oil in a large pan over medium heat. Add onions and sauté for 5 minutes until softened.\n3. Add ginger and garlic, cook for 1 minute until fragrant.\n4. Add 2 teaspoons cumin, 2 teaspoons coriander, 1 teaspoon turmeric, 1-2 teaspoons cayenne pepper, and 1 teaspoon garam masala. Stir for 30 seconds.\n5. Add chopped tomatoes and cook for 8-10 minutes until they break down into a sauce.\n6. Add sliced mushrooms and 1/2 cup water. Cook for 8 minutes until mushrooms are tender.\n7. Stir in 4 cups fresh spinach and cook for 2-3 minutes until wilted.\n8. Add 1/2 cup cream or coconut milk, salt to taste, and simmer for 2 minutes.\n9. Garnish with fresh cilantro and serve with rice or naan.",
      "source": "Generated",
      "rating": 5,
      "cook_count": 1,
      "tags": [
        "vegetarian"
      ],
      "ingredients": [
        "None",
        "Mushrooms (16 oz)",
        "fresh spinach (4 cups)",
        "onions (2 medium)",
        "tomatoes (3 medium)",
        "fresh ginger (2-inch piece)",
        "garlic (6 cloves)",
        "fresh cilantro (1/4 cup)",
        "heavy cream or coconut milk (1/2 cup)"
      ],
      "id": "59634d2f-ffb2-4942-9dc5-28f14d5e98ad",
      "created_date": "2025-12-14T21:17:07.270510",
      "last_cooked": "2025-12-16T20:56:41.714974"
    },
    {
      "name": "Italian Eggplant and Basil Risotto",
      "description": "A creamy Mediterranean risotto featuring tender golden eggplant, fresh basil, and Parmesan cheese. This Italian-inspired dish combines earthy vegetables with aromatic herbs for a comforting, flavorful meal.",
      "ingredients_available": "None",
      "ingredients_needed": "Arborio rice (1.5 cups), eggplant (1 medium), mushrooms (6 oz), onion (1 medium), garlic (3 cloves), vegetable broth (6.5 cups), lemon (1), Parmesan cheese (1 cup grated), butter (3 tablespoons), olive oil (4 tablespoons), fresh basil (1/2 cup chopped), fresh parsley (1 tablespoon)",
      "time_minutes": "45",
      "difficulty": "medium",
      "reason": "Replaced white wine with additional vegetable broth and lemon juice to provide acidity and depth of flavor while making the recipe pregnancy-safe and alcohol-free.",
      "instructions": "1. Heat 6.5 cups vegetable broth in a pot and keep warm on low heat.\n2. Dice 1 medium eggplant into 1/2-inch cubes. Heat 2 tablespoons olive oil in a large pan over medium-high heat and sauté eggplant for 6-7 minutes until golden and tender. Remove and set aside.\n3. Slice 6 oz mushrooms. Add 1 tablespoon olive oil to the same pan and sauté mushrooms for 5 minutes until golden. Remove and set aside with eggplant.\n4. Add 1 tablespoon olive oil to the pan and sauté 1 diced onion for 4 minutes until translucent. Add 3 minced garlic cloves and cook 1 minute.\n5. Add 1.5 cups Arborio rice and stir for 2 minutes until edges are translucent.\n6. Pour in 1/2 cup of the warm vegetable broth mixed with 1 tablespoon fresh lemon juice and stir until absorbed.\n7. Add remaining warm broth one ladle at a time, stirring constantly, waiting until liquid is absorbed before adding more (about 20-25 minutes total).\n8. When rice is creamy and al dente, stir in cooked eggplant, mushrooms, 1 cup grated Parmesan, and 3 tablespoons butter.\n9. Remove from heat and fold in 1/2 cup fresh chopped basil. Season with salt and pepper, garnish with parsley, and serve immediately.",
      "id": "ee817905-f1c8-4301-baab-8ddaf1bb28a9",
      "rating": 5,
      "last_cooked": "2025-12-17T19:00:51.154199",
      "cook_count": 1
    },
    {
      "name": "Creamy Roasted Tomato and Basil Soup with Garlic Crostini",
      "description": "A rich, velvety Italian-style tomato soup made from roasted fresh tomatoes and aromatic herbs, served with crispy bread. This comforting dinner is naturally vegetarian and packed with flavor.",
      "ingredients_available": "Olive oil, balsamic vinegar, salt, black pepper, dried oregano, red pepper flakes, garlic powder",
      "ingredients_needed": "3 lbs Roma tomatoes, 1 white onion, 6 cloves garlic, 1 bunch fresh basil, 1 pint vegetable broth, 1/2 cup heavy cream, 1 baguette",
      "time_minutes": "45",
      "difficulty": "easy",
      "reason": "This recipe fits the \"Italian\" and \"Soup\" categories perfectly, providing a classic, comforting dinner that relies on simple, fresh produce.",
      "instructions": "1. Preheat oven to 400°F (200°C). Halve 3 lbs of tomatoes and peel 6 cloves of garlic.\n2. Place tomatoes, garlic, and 1 chopped onion on a baking sheet. Drizzle with olive oil, salt, pepper, and dried oregano. Roast for 30 minutes.\n3. Transfer the roasted vegetables and all juices into a large pot. Add 1 pint of vegetable broth.\n4. Use an immersion blender to blend until smooth (or transfer to a standard blender in batches).\n5. Stir in 1/2 cup heavy cream and a handful of chopped fresh basil. Simmer on low for 5 minutes.\n6. Slice the baguette, brush with olive oil and garlic powder, and toast in the oven for 5 minutes until crisp.\n7. Serve the soup hot with the garlic crostini on the side.",
      "source": "Generated",
      "rating": 0,
      "cook_count": 0,
      "tags": [
        "vegetarian"
      ],
      "ingredients": [
        "Olive oil",
        "balsamic vinegar",
        "salt",
        "black pepper",
        "dried oregano",
        "red pepper flakes",
        "garlic powder",
        "3 lbs Roma tomatoes",
        "1 white onion",
        "6 cloves garlic",
        "1 bunch fresh basil",
        "1 pint vegetable broth",
        "1/2 cup heavy cream",
        "1 baguette"
      ],
      "id": "13e3b15a-2117-4ce3-8ad5-0e297d79a4cb"
    },
    {
      "name": "Spicy Black Bean & Corn Soup",
      "description": "A hearty, protein-packed soup with a smoky kick from chipotle and cumin. It's naturally vegan and very filling for a dinner meal.",
      "ingredients_available": "Onion, Garlic, Olive oil, Vegetable broth, Cumin, Chili powder, Hot sauce, Salt, Black pepper",
      "ingredients_needed": "2 cans Black beans, 1 bag Frozen corn, 1 Lime, 1 bunch Cilantro, 1 Jalapeño",
      "time_minutes": "25",
      "difficulty": "easy",
      "reason": "This fits the soup and spicy criteria perfectly while using shelf-stable beans and frozen vegetables.",
      "instructions": "1. Finely dice 1 onion and mince 3 cloves of garlic and 1 jalapeño (keep seeds for extra spice).\n2. Sauté onion and jalapeño in 2 tbsp olive oil for 5 minutes until soft; add garlic and cook for 1 minute.\n3. Add 1 tbsp cumin and 1 tbsp chili powder, stirring for 30 seconds.\n4. Pour in 4 cups vegetable broth, 2 drained cans of black beans, and 2 cups of frozen corn.\n5. Simmer for 15 minutes.\n6. Use an immersion blender to partially blend the soup (leave some beans whole for texture).\n7. Stir in the juice of 1 lime and top with chopped cilantro and plenty of hot sauce.",
      "source": "Generated",
      "rating": 0,
      "cook_count": 0,
      "tags": [
        "vegetarian"
      ],
      "ingredients": [
        "Onion",
        "Garlic",
        "Olive oil",
        "Vegetable broth",
        "Cumin",
        "Chili powder",
        "Hot sauce",
        "Salt",
        "Black pepper",
        "2 cans Black beans",
        "1 bag Frozen corn",
        "1 Lime",
        "1 bunch Cilantro",
        "1 Jalapeño"
      ],
      "id": "b631be4a-9b70-403c-97e4-3ed64cec58b9",
      "created_date": "2025-12-21T21:17:20.197341"
    },
    {
      "name": "Spicy Mediterranean-Style Brown Lentil & Tomato Soup",
      "description": "A bold and zesty twist on the classic lentil soup, featuring fresh tomatoes and a spicy kick of red pepper flakes.",
      "ingredients_available": "Olive oil, salt, pepper, dried thyme, bay leaves, garlic powder",
      "ingredients_needed": "1 lb dry brown lentils, 2 large carrots, 2 stalks celery, 1 large yellow onion, 2 large fresh tomatoes, 1 tsp red pepper flakes, 6 cups vegetable broth, 1 bunch fresh parsley",
      "time_minutes": "45",
      "difficulty": "easy",
      "reason": "Added fresh tomatoes for brightness and red pepper flakes to meet the user's request for a spicy flavor profile while keeping the dish vegetarian.",
      "instructions": "1. Finely dice the onion, carrots, and celery. Core and chop the fresh tomatoes.\n2. Heat 2 tbsp olive oil in a large pot over medium heat. Sauté the onion, carrots, and celery for 8 minutes until softened.\n3. Add the chopped tomatoes and 1 tsp red pepper flakes to the pot. Sauté for another 3 minutes until the tomatoes begin to break down.\n4. Rinse 1 lb lentils and add to the pot along with 1 tsp dried thyme, 1/2 tsp garlic powder, and 2 bay leaves.\n5. Pour in 6 cups vegetable broth. Bring to a boil, then reduce heat and simmer for 30-35 minutes until lentils are tender.\n6. Season with salt and pepper to taste.\n7. Remove bay leaves and stir in 1/4 cup chopped fresh parsley before serving.",
      "id": "4686a722-e1b2-4d04-bcea-ecfb891a3acf",
      "created_date": "2025-12-21T22:43:08.967390"
    },
    {
      "name": "Spicy Mediterranean-Style Brown Lentil & Tomato Soup",
      "description": "A bold and zesty twist on the classic lentil soup, featuring fresh tomatoes and a spicy kick of red pepper flakes.",
      "ingredients_available": "Olive oil, salt, pepper, dried thyme, bay leaves, garlic powder",
      "ingredients_needed": "1 lb dry brown lentils, 2 large carrots, 2 stalks celery, 1 large yellow onion, 2 large fresh tomatoes, 1 tsp red pepper flakes, 6 cups vegetable broth, 1 bunch fresh parsley",
      "time_minutes": "45",
      "difficulty": "easy",
      "reason": "Added fresh tomatoes for brightness and red pepper flakes to meet the user's request for a spicy flavor profile while keeping the dish vegetarian.",
      "instructions": "1. Finely dice the onion, carrots, and celery. Core and chop the fresh tomatoes.\n2. Heat 2 tbsp olive oil in a large pot over medium heat. Sauté the onion, carrots, and celery for 8 minutes until softened.\n3. Add the chopped tomatoes and 1 tsp red pepper flakes to the pot. Sauté for another 3 minutes until the tomatoes begin to break down.\n4. Rinse 1 lb lentils and add to the pot along with 1 tsp dried thyme, 1/2 tsp garlic powder, and 2 bay leaves.\n5. Pour in 6 cups vegetable broth. Bring to a boil, then reduce heat and simmer for 30-35 minutes until lentils are tender.\n6. Season with salt and pepper to taste.\n7. Remove bay leaves and stir in 1/4 cup chopped fresh parsley before serving.",
      "id": "a1adcc26-1fbd-421d-944a-7a3a1eb6af60",
      "created_date": "2025-12-21T22:43:44.718756"
    },
    {
      "name": "Dauphinoise Potatoes",
      "description": "A classic French side dish featuring thinly sliced potatoes baked in a savory garlic-infused cream sauce and topped with melted Gruyere cheese.",
      "ingredients_available": "Salt",
      "ingredients_needed": "2 lbs russet or Yukon Gold potatoes, 2 cups heavy cream, 3 cloves garlic (minced), 1.5 cups shredded Gruyere cheese, 2 tbsp butter",
      "time_minutes": "45",
      "difficulty": "easy",
      "reason": "Converted temperature from Celsius (160°C) to Fahrenheit (320-325°F) and updated measurements to US units (lbs, cups, tbsp) while maintaining the vegetarian profile.",
      "instructions": "1. Preheat your oven to 325°F and grease a 9x13 inch baking dish with butter.\n2. Peel and slice the potatoes into 1/8-inch thick rounds.\n3. In a large saucepan, combine the heavy cream, minced garlic, salt, and sliced potatoes.\n4. Bring the mixture to a light simmer over medium heat, then immediately remove from the burner.\n5. Transfer the potato and cream mixture into the prepared baking dish, spreading them into even layers.\n6. Sprinkle the shredded Gruyere cheese evenly over the top.\n7. Bake at 325°F for approximately 30 to 35 minutes, or until the potatoes are tender and the top is golden brown.",
      "source": "Captured",
      "tags": [
        "captured"
      ],
      "rating": 0,
      "cook_count": 0,
      "id": "bd6e32d4-2639-4817-be25-9f6f3777bfdd",
      "created_date": "2025-12-24T14:16:11.566201"
    },
    {
      "name": "Eggplant Parmesan",
      "description": "This lighter take on the classic Italian dish uses oven-baked breaded eggplant slices instead of deep-frying to reduce grease and prep time while maintaining a crisp texture.",
      "time_minutes": 90,
      "difficulty": "medium",
      "ingredients": [
        "2 pounds eggplant (sliced into 1/4-inch-thick rounds)",
        "1 1/2 teaspoons kosher salt (for draining eggplant)",
        "1/2 teaspoon black pepper",
        "8 slices hearty white sandwich bread (torn into quarters)",
        "2 ounces Parmesan cheese, grated (1 cup)",
        "1 cup all-purpose flour",
        "1 teaspoon black pepper (for flour mixture)",
        "4 large eggs",
        "6 tablespoons vegetable oil",
        "3 cans (14.5-ounce) diced tomatoes",
        "2 tablespoons extra-virgin olive oil",
        "4 cloves garlic (minced)",
        "1/4 teaspoon red pepper flakes",
        "1/4 cup fresh basil (chopped)",
        "1/2 teaspoon kosher salt (for sauce, to taste)",
        "1/2 teaspoon black pepper (for sauce, to taste)",
        "8 ounces mozzarella cheese (shredded, 2 cups)",
        "1 ounce Parmesan cheese, grated (1/2 cup)",
        "10 leaves fresh basil (roughly torn)"
      ],
      "instructions": "1. Toss sliced eggplant with 1 1/2 teaspoons salt in a colander and let drain for 30 to 45 minutes until about 2 tablespoons of liquid is released. Wipe excess salt away, spread on paper towels, and pat thoroughly dry.\n2. Adjust oven racks to upper-middle and lower-middle positions, place a rimmed baking sheet on each rack, and preheat oven to 425 degrees.\n3. Pulse 8 slices of bread in a food processor (about 15 pulses) until you have 4 cups of fine crumbs. Transfer to a shallow dish and stir in 1 cup grated Parmesan and 1/2 teaspoon pepper.\n4. Combine 1 cup flour and 1 teaspoon pepper in a large zipper-lock bag. Beat 4 eggs in a second shallow dish.\n5. Working with 8 to 10 eggplant slices at a time, shake in the flour bag to coat, dip in eggs, and then coat with the bread-crumb mixture. Transfer to a wire rack set in a separate baking sheet.\n6. Remove preheated sheets from the oven. Add 3 tablespoons oil to each sheet, tilting to coat. Place eggplant on sheets in a single layer and bake for about 30 minutes, rotating sheets after 10 minutes and flipping slices after 20 minutes.\n7. For the sauce: Process 2 cans of diced tomatoes in the food processor for 5 seconds. Heat 2 tablespoons olive oil, 4 minced garlic cloves, and 1/4 teaspoon red pepper flakes in a saucepan over medium-high heat for 3 minutes.\n8. Stir in the processed tomatoes and the 1 remaining can of diced tomatoes. Bring to a boil, then reduce to a simmer and cook for about 15 minutes until reduced to 4 cups. Remove from heat and stir in 1/4 cup chopped basil; season with salt and pepper.\n9. Spread 1 cup sauce over the bottom of a 13 by 9-inch baking dish. Layer half of the eggplant slices, overlapping to fit. Top with 1 cup sauce and 1 cup mozzarella.\n10. Layer remaining eggplant into the dish. Dot with 1 cup sauce (leaving most eggplant exposed to stay crisp). Sprinkle with 1/2 cup Parmesan and the remaining 1 cup mozzarella.\n11. Bake until sauce is bubbling and cheese is browned, 13 to 15 minutes. Let cool for 10 minutes, sprinkle with 10 torn basil leaves, and serve with any remaining sauce.",
      "source": "Captured",
      "rating": 0,
      "cook_count": 0,
      "tags": [
        "captured"
      ],
      "id": "d8ed3f6d-591f-4944-ac3b-32480d62324b",
      "created_date": "2025-12-24T14:30:16.321331"
    },
    {
      "name": "Spicy Mediterranean-Style Brown Lentil & Tomato Soup",
      "description": "A bold and zesty twist on the classic lentil soup, featuring fresh tomatoes and a spicy kick of red pepper flakes.",
      "ingredients_available": "Olive oil, salt, pepper, dried thyme, bay leaves, garlic powder",
      "ingredients_needed": "1 lb dry brown lentils, 2 large carrots, 2 stalks celery, 1 large yellow onion, 2 large fresh tomatoes, 1 tsp red pepper flakes, 6 cups vegetable broth, 1 bunch fresh parsley",
      "time_minutes": "45",
      "difficulty": "easy",
      "reason": "Added fresh tomatoes for brightness and red pepper flakes to meet the user's request for a spicy flavor profile while keeping the dish vegetarian.",
      "instructions": "1. Finely dice the onion, carrots, and celery. Core and chop the fresh tomatoes.\n2. Heat 2 tbsp olive oil in a large pot over medium heat. Sauté the onion, carrots, and celery for 8 minutes until softened.\n3. Add the chopped tomatoes and 1 tsp red pepper flakes to the pot. Sauté for another 3 minutes until the tomatoes begin to break down.\n4. Rinse 1 lb lentils and add to the pot along with 1 tsp dried thyme, 1/2 tsp garlic powder, and 2 bay leaves.\n5. Pour in 6 cups vegetable broth. Bring to a boil, then reduce heat and simmer for 30-35 minutes until lentils are tender.\n6. Season with salt and pepper to taste.\n7. Remove bay leaves and stir in 1/4 cup chopped fresh parsley before serving.",
      "id": "67bda00d-c1e9-40bf-84d1-656ba3a1990e",
      "created_date": "2025-12-24T15:01:25.479008"
    }
  ]
}