{
  "last_updated": "2026-01-20T00:01:50.716253",
  "recipes": [
    {
      "name": "Spicy Vegetarian Sopa Azteca (Tortilla Soup) with Ancho, Pasilla & Guajillo Chiles",
      "time_minutes": 60,
      "difficulty": "medium",
      "cuisine": null,
      "rating": 5,
      "last_made": "2025-11-30",
      "ingredients": [
        "2 tablespoons Extra Virgin Olive Oil",
        "4 cups tomatoes (diced)",
        "6 cups vegetable broth",
        "1 onion (diced)",
        "4 cloves garlic (minced)",
        "2-3 ancho chiles",
        "1-2 pasilla chiles",
        "2 guajillo chiles",
        "2-3 Serrano peppers (sliced)",
        "4 corn tortillas",
        "1½ cups corn kernels",
        "1 avocado (sliced)",
        "3 tablespoons fresh cilantro",
        "3 tablespoons fresh recao",
        "1 lime",
        "salt",
        "pepper"
      ],
      "notes": "We added black beans which gave it a bit of depth. Don’t forget to de-seed the chilis and watch the heat",
      "type": null,
      "times_made": null,
      "id": "83923ded-2300-4b71-b0c8-aeeba83c10d0",
      "source": "Loved",
      "created_date": "2025-11-30T11:24:14.348342",
      "cook_count": 0,
      "tags": [
        "vegetarian"
      ]
    },
    {
      "name": "Spicy Mushroom and Spinach Curry",
      "description": "A rich and fiery Indian curry featuring tender mushrooms and wilted spinach in a creamy tomato-based sauce with aromatic spices. Perfect for those who love bold, spicy flavors.",
      "ingredients_available": "None",
      "ingredients_needed": "Mushrooms (16 oz), fresh spinach (4 cups), onions (2 medium), tomatoes (3 medium), fresh ginger (2-inch piece), garlic (6 cloves), fresh cilantro (1/4 cup), heavy cream or coconut milk (1/2 cup)",
      "time_minutes": "35",
      "difficulty": "easy",
      "reason": "Directly matches your request for a spicy Indian curry while incorporating mushrooms for hearty texture.",
      "instructions": "1. Dice 2 medium onions, mince 6 garlic cloves and 2-inch piece of ginger, chop 3 tomatoes, and slice 16 oz mushrooms.\n2. Heat 2 tablespoons oil in a large pan over medium heat. Add onions and sauté for 5 minutes until softened.\n3. Add ginger and garlic, cook for 1 minute until fragrant.\n4. Add 2 teaspoons cumin, 2 teaspoons coriander, 1 teaspoon turmeric, 1-2 teaspoons cayenne pepper, and 1 teaspoon garam masala. Stir for 30 seconds.\n5. Add chopped tomatoes and cook for 8-10 minutes until they break down into a sauce.\n6. Add sliced mushrooms and 1/2 cup water. Cook for 8 minutes until mushrooms are tender.\n7. Stir in 4 cups fresh spinach and cook for 2-3 minutes until wilted.\n8. Add 1/2 cup cream or coconut milk, salt to taste, and simmer for 2 minutes.\n9. Garnish with fresh cilantro and serve with rice or naan.",
      "source": "Generated",
      "rating": 5,
      "cook_count": 1,
      "tags": [
        "vegetarian"
      ],
      "ingredients": [
        "None",
        "Mushrooms (16 oz)",
        "fresh spinach (4 cups)",
        "onions (2 medium)",
        "tomatoes (3 medium)",
        "fresh ginger (2-inch piece)",
        "garlic (6 cloves)",
        "fresh cilantro (1/4 cup)",
        "heavy cream or coconut milk (1/2 cup)"
      ],
      "id": "59634d2f-ffb2-4942-9dc5-28f14d5e98ad",
      "created_date": "2025-12-14T21:17:07.270510",
      "last_cooked": "2025-12-16T20:56:41.714974"
    },
    {
      "name": "Italian Eggplant and Basil Risotto",
      "description": "A creamy Mediterranean risotto featuring tender golden eggplant, fresh basil, and Parmesan cheese. This Italian-inspired dish combines earthy vegetables with aromatic herbs for a comforting, flavorful meal.",
      "ingredients_available": "None",
      "ingredients_needed": "Arborio rice (1.5 cups), eggplant (1 medium), mushrooms (6 oz), onion (1 medium), garlic (3 cloves), vegetable broth (6.5 cups), lemon (1), Parmesan cheese (1 cup grated), butter (3 tablespoons), olive oil (4 tablespoons), fresh basil (1/2 cup chopped), fresh parsley (1 tablespoon)",
      "time_minutes": "45",
      "difficulty": "medium",
      "reason": "Replaced white wine with additional vegetable broth and lemon juice to provide acidity and depth of flavor while making the recipe pregnancy-safe and alcohol-free.",
      "instructions": "1. Heat 6.5 cups vegetable broth in a pot and keep warm on low heat.\n2. Dice 1 medium eggplant into 1/2-inch cubes. Heat 2 tablespoons olive oil in a large pan over medium-high heat and sauté eggplant for 6-7 minutes until golden and tender. Remove and set aside.\n3. Slice 6 oz mushrooms. Add 1 tablespoon olive oil to the same pan and sauté mushrooms for 5 minutes until golden. Remove and set aside with eggplant.\n4. Add 1 tablespoon olive oil to the pan and sauté 1 diced onion for 4 minutes until translucent. Add 3 minced garlic cloves and cook 1 minute.\n5. Add 1.5 cups Arborio rice and stir for 2 minutes until edges are translucent.\n6. Pour in 1/2 cup of the warm vegetable broth mixed with 1 tablespoon fresh lemon juice and stir until absorbed.\n7. Add remaining warm broth one ladle at a time, stirring constantly, waiting until liquid is absorbed before adding more (about 20-25 minutes total).\n8. When rice is creamy and al dente, stir in cooked eggplant, mushrooms, 1 cup grated Parmesan, and 3 tablespoons butter.\n9. Remove from heat and fold in 1/2 cup fresh chopped basil. Season with salt and pepper, garnish with parsley, and serve immediately.",
      "id": "ee817905-f1c8-4301-baab-8ddaf1bb28a9",
      "rating": 5,
      "last_cooked": "2025-12-17T19:00:51.154199",
      "cook_count": 1
    },
    {
      "name": "Creamy Roasted Tomato and Basil Soup with Garlic Crostini",
      "description": "A rich, velvety Italian-style tomato soup made from roasted fresh tomatoes and aromatic herbs, served with crispy bread. This comforting dinner is naturally vegetarian and packed with flavor.",
      "ingredients_available": "Olive oil, balsamic vinegar, salt, black pepper, dried oregano, red pepper flakes, garlic powder",
      "ingredients_needed": "3 lbs Roma tomatoes, 1 white onion, 6 cloves garlic, 1 bunch fresh basil, 1 pint vegetable broth, 1/2 cup heavy cream, 1 baguette",
      "time_minutes": "45",
      "difficulty": "easy",
      "reason": "This recipe fits the \"Italian\" and \"Soup\" categories perfectly, providing a classic, comforting dinner that relies on simple, fresh produce.",
      "instructions": "1. Preheat oven to 400°F (200°C). Halve 3 lbs of tomatoes and peel 6 cloves of garlic.\n2. Place tomatoes, garlic, and 1 chopped onion on a baking sheet. Drizzle with olive oil, salt, pepper, and dried oregano. Roast for 30 minutes.\n3. Transfer the roasted vegetables and all juices into a large pot. Add 1 pint of vegetable broth.\n4. Use an immersion blender to blend until smooth (or transfer to a standard blender in batches).\n5. Stir in 1/2 cup heavy cream and a handful of chopped fresh basil. Simmer on low for 5 minutes.\n6. Slice the baguette, brush with olive oil and garlic powder, and toast in the oven for 5 minutes until crisp.\n7. Serve the soup hot with the garlic crostini on the side.",
      "source": "Generated",
      "rating": 0,
      "cook_count": 0,
      "tags": [
        "vegetarian"
      ],
      "ingredients": [
        "Olive oil",
        "balsamic vinegar",
        "salt",
        "black pepper",
        "dried oregano",
        "red pepper flakes",
        "garlic powder",
        "3 lbs Roma tomatoes",
        "1 white onion",
        "6 cloves garlic",
        "1 bunch fresh basil",
        "1 pint vegetable broth",
        "1/2 cup heavy cream",
        "1 baguette"
      ],
      "id": "13e3b15a-2117-4ce3-8ad5-0e297d79a4cb"
    },
    {
      "name": "Spicy Black Bean & Corn Soup",
      "description": "A hearty, protein-packed soup with a smoky kick from chipotle and cumin. It's naturally vegan and very filling for a dinner meal.",
      "ingredients_available": "Onion, Garlic, Olive oil, Vegetable broth, Cumin, Chili powder, Hot sauce, Salt, Black pepper",
      "ingredients_needed": "2 cans Black beans, 1 bag Frozen corn, 1 Lime, 1 bunch Cilantro, 1 Jalapeño",
      "time_minutes": "25",
      "difficulty": "easy",
      "reason": "This fits the soup and spicy criteria perfectly while using shelf-stable beans and frozen vegetables.",
      "instructions": "1. Finely dice 1 onion and mince 3 cloves of garlic and 1 jalapeño (keep seeds for extra spice).\n2. Sauté onion and jalapeño in 2 tbsp olive oil for 5 minutes until soft; add garlic and cook for 1 minute.\n3. Add 1 tbsp cumin and 1 tbsp chili powder, stirring for 30 seconds.\n4. Pour in 4 cups vegetable broth, 2 drained cans of black beans, and 2 cups of frozen corn.\n5. Simmer for 15 minutes.\n6. Use an immersion blender to partially blend the soup (leave some beans whole for texture).\n7. Stir in the juice of 1 lime and top with chopped cilantro and plenty of hot sauce.",
      "source": "Generated",
      "rating": 0,
      "cook_count": 0,
      "tags": [
        "vegetarian"
      ],
      "ingredients": [
        "Onion",
        "Garlic",
        "Olive oil",
        "Vegetable broth",
        "Cumin",
        "Chili powder",
        "Hot sauce",
        "Salt",
        "Black pepper",
        "2 cans Black beans",
        "1 bag Frozen corn",
        "1 Lime",
        "1 bunch Cilantro",
        "1 Jalapeño"
      ],
      "id": "b631be4a-9b70-403c-97e4-3ed64cec58b9",
      "created_date": "2025-12-21T21:17:20.197341"
    },
    {
      "name": "Spicy Mediterranean-Style Brown Lentil & Tomato Soup",
      "description": "A bold and zesty twist on the classic lentil soup, featuring fresh tomatoes and a spicy kick of red pepper flakes.",
      "ingredients_available": "Olive oil, salt, pepper, dried thyme, bay leaves, garlic powder",
      "ingredients_needed": "1 lb dry brown lentils, 2 large carrots, 2 stalks celery, 1 large yellow onion, 2 large fresh tomatoes, 1 tsp red pepper flakes, 6 cups vegetable broth, 1 bunch fresh parsley",
      "time_minutes": "45",
      "difficulty": "easy",
      "reason": "Added fresh tomatoes for brightness and red pepper flakes to meet the user's request for a spicy flavor profile while keeping the dish vegetarian.",
      "instructions": "1. Finely dice the onion, carrots, and celery. Core and chop the fresh tomatoes.\n2. Heat 2 tbsp olive oil in a large pot over medium heat. Sauté the onion, carrots, and celery for 8 minutes until softened.\n3. Add the chopped tomatoes and 1 tsp red pepper flakes to the pot. Sauté for another 3 minutes until the tomatoes begin to break down.\n4. Rinse 1 lb lentils and add to the pot along with 1 tsp dried thyme, 1/2 tsp garlic powder, and 2 bay leaves.\n5. Pour in 6 cups vegetable broth. Bring to a boil, then reduce heat and simmer for 30-35 minutes until lentils are tender.\n6. Season with salt and pepper to taste.\n7. Remove bay leaves and stir in 1/4 cup chopped fresh parsley before serving.",
      "id": "4686a722-e1b2-4d04-bcea-ecfb891a3acf",
      "created_date": "2025-12-21T22:43:08.967390"
    },
    {
      "name": "Spicy Mediterranean-Style Brown Lentil & Tomato Soup",
      "description": "A bold and zesty twist on the classic lentil soup, featuring fresh tomatoes and a spicy kick of red pepper flakes.",
      "ingredients_available": "Olive oil, salt, pepper, dried thyme, bay leaves, garlic powder",
      "ingredients_needed": "1 lb dry brown lentils, 2 large carrots, 2 stalks celery, 1 large yellow onion, 2 large fresh tomatoes, 1 tsp red pepper flakes, 6 cups vegetable broth, 1 bunch fresh parsley",
      "time_minutes": "45",
      "difficulty": "easy",
      "reason": "Added fresh tomatoes for brightness and red pepper flakes to meet the user's request for a spicy flavor profile while keeping the dish vegetarian.",
      "instructions": "1. Finely dice the onion, carrots, and celery. Core and chop the fresh tomatoes.\n2. Heat 2 tbsp olive oil in a large pot over medium heat. Sauté the onion, carrots, and celery for 8 minutes until softened.\n3. Add the chopped tomatoes and 1 tsp red pepper flakes to the pot. Sauté for another 3 minutes until the tomatoes begin to break down.\n4. Rinse 1 lb lentils and add to the pot along with 1 tsp dried thyme, 1/2 tsp garlic powder, and 2 bay leaves.\n5. Pour in 6 cups vegetable broth. Bring to a boil, then reduce heat and simmer for 30-35 minutes until lentils are tender.\n6. Season with salt and pepper to taste.\n7. Remove bay leaves and stir in 1/4 cup chopped fresh parsley before serving.",
      "id": "a1adcc26-1fbd-421d-944a-7a3a1eb6af60",
      "created_date": "2025-12-21T22:43:44.718756"
    },
    {
      "name": "Dauphinoise Potatoes",
      "description": "A classic French side dish featuring thinly sliced potatoes baked in a savory garlic-infused cream sauce and topped with melted Gruyere cheese.",
      "ingredients_available": "Salt",
      "ingredients_needed": "2 lbs russet or Yukon Gold potatoes, 2 cups heavy cream, 3 cloves garlic (minced), 1.5 cups shredded Gruyere cheese, 2 tbsp butter",
      "time_minutes": "45",
      "difficulty": "easy",
      "reason": "Converted temperature from Celsius (160°C) to Fahrenheit (320-325°F) and updated measurements to US units (lbs, cups, tbsp) while maintaining the vegetarian profile.",
      "instructions": "1. Preheat your oven to 325°F and grease a 9x13 inch baking dish with butter.\n2. Peel and slice the potatoes into 1/8-inch thick rounds.\n3. In a large saucepan, combine the heavy cream, minced garlic, salt, and sliced potatoes.\n4. Bring the mixture to a light simmer over medium heat, then immediately remove from the burner.\n5. Transfer the potato and cream mixture into the prepared baking dish, spreading them into even layers.\n6. Sprinkle the shredded Gruyere cheese evenly over the top.\n7. Bake at 325°F for approximately 30 to 35 minutes, or until the potatoes are tender and the top is golden brown.",
      "source": "Captured",
      "tags": [
        "captured"
      ],
      "rating": 0,
      "cook_count": 0,
      "id": "bd6e32d4-2639-4817-be25-9f6f3777bfdd",
      "created_date": "2025-12-24T14:16:11.566201"
    },
    {
      "name": "Eggplant Parmesan",
      "description": "This lighter take on the classic Italian dish uses oven-baked breaded eggplant slices instead of deep-frying to reduce grease and prep time while maintaining a crisp texture.",
      "time_minutes": 90,
      "difficulty": "medium",
      "ingredients": [
        "2 pounds eggplant (sliced into 1/4-inch-thick rounds)",
        "1 1/2 teaspoons kosher salt (for draining eggplant)",
        "1/2 teaspoon black pepper",
        "8 slices hearty white sandwich bread (torn into quarters)",
        "2 ounces Parmesan cheese, grated (1 cup)",
        "1 cup all-purpose flour",
        "1 teaspoon black pepper (for flour mixture)",
        "4 large eggs",
        "6 tablespoons vegetable oil",
        "3 cans (14.5-ounce) diced tomatoes",
        "2 tablespoons extra-virgin olive oil",
        "4 cloves garlic (minced)",
        "1/4 teaspoon red pepper flakes",
        "1/4 cup fresh basil (chopped)",
        "1/2 teaspoon kosher salt (for sauce, to taste)",
        "1/2 teaspoon black pepper (for sauce, to taste)",
        "8 ounces mozzarella cheese (shredded, 2 cups)",
        "1 ounce Parmesan cheese, grated (1/2 cup)",
        "10 leaves fresh basil (roughly torn)"
      ],
      "instructions": "1. Toss sliced eggplant with 1 1/2 teaspoons salt in a colander and let drain for 30 to 45 minutes until about 2 tablespoons of liquid is released. Wipe excess salt away, spread on paper towels, and pat thoroughly dry.\n2. Adjust oven racks to upper-middle and lower-middle positions, place a rimmed baking sheet on each rack, and preheat oven to 425 degrees.\n3. Pulse 8 slices of bread in a food processor (about 15 pulses) until you have 4 cups of fine crumbs. Transfer to a shallow dish and stir in 1 cup grated Parmesan and 1/2 teaspoon pepper.\n4. Combine 1 cup flour and 1 teaspoon pepper in a large zipper-lock bag. Beat 4 eggs in a second shallow dish.\n5. Working with 8 to 10 eggplant slices at a time, shake in the flour bag to coat, dip in eggs, and then coat with the bread-crumb mixture. Transfer to a wire rack set in a separate baking sheet.\n6. Remove preheated sheets from the oven. Add 3 tablespoons oil to each sheet, tilting to coat. Place eggplant on sheets in a single layer and bake for about 30 minutes, rotating sheets after 10 minutes and flipping slices after 20 minutes.\n7. For the sauce: Process 2 cans of diced tomatoes in the food processor for 5 seconds. Heat 2 tablespoons olive oil, 4 minced garlic cloves, and 1/4 teaspoon red pepper flakes in a saucepan over medium-high heat for 3 minutes.\n8. Stir in the processed tomatoes and the 1 remaining can of diced tomatoes. Bring to a boil, then reduce to a simmer and cook for about 15 minutes until reduced to 4 cups. Remove from heat and stir in 1/4 cup chopped basil; season with salt and pepper.\n9. Spread 1 cup sauce over the bottom of a 13 by 9-inch baking dish. Layer half of the eggplant slices, overlapping to fit. Top with 1 cup sauce and 1 cup mozzarella.\n10. Layer remaining eggplant into the dish. Dot with 1 cup sauce (leaving most eggplant exposed to stay crisp). Sprinkle with 1/2 cup Parmesan and the remaining 1 cup mozzarella.\n11. Bake until sauce is bubbling and cheese is browned, 13 to 15 minutes. Let cool for 10 minutes, sprinkle with 10 torn basil leaves, and serve with any remaining sauce.",
      "source": "Captured",
      "rating": 0,
      "cook_count": 0,
      "tags": [
        "captured"
      ],
      "id": "d8ed3f6d-591f-4944-ac3b-32480d62324b",
      "created_date": "2025-12-24T14:30:16.321331"
    },
    {
      "name": "Spicy Mediterranean-Style Brown Lentil & Tomato Soup",
      "description": "A bold and zesty twist on the classic lentil soup, featuring fresh tomatoes and a spicy kick of red pepper flakes.",
      "ingredients_available": "Olive oil, salt, pepper, dried thyme, bay leaves, garlic powder",
      "ingredients_needed": "1 lb dry brown lentils, 2 large carrots, 2 stalks celery, 1 large yellow onion, 2 large fresh tomatoes, 1 tsp red pepper flakes, 6 cups vegetable broth, 1 bunch fresh parsley",
      "time_minutes": "45",
      "difficulty": "easy",
      "reason": "Added fresh tomatoes for brightness and red pepper flakes to meet the user's request for a spicy flavor profile while keeping the dish vegetarian.",
      "instructions": "1. Finely dice the onion, carrots, and celery. Core and chop the fresh tomatoes.\n2. Heat 2 tbsp olive oil in a large pot over medium heat. Sauté the onion, carrots, and celery for 8 minutes until softened.\n3. Add the chopped tomatoes and 1 tsp red pepper flakes to the pot. Sauté for another 3 minutes until the tomatoes begin to break down.\n4. Rinse 1 lb lentils and add to the pot along with 1 tsp dried thyme, 1/2 tsp garlic powder, and 2 bay leaves.\n5. Pour in 6 cups vegetable broth. Bring to a boil, then reduce heat and simmer for 30-35 minutes until lentils are tender.\n6. Season with salt and pepper to taste.\n7. Remove bay leaves and stir in 1/4 cup chopped fresh parsley before serving.",
      "id": "67bda00d-c1e9-40bf-84d1-656ba3a1990e",
      "created_date": "2025-12-24T15:01:25.479008"
    },
    {
      "name": "Vegetarian Hot and Sour Soup",
      "description": "A savory, tangy, and spicy traditional Chinese soup packed with a variety of mushrooms, tofu, and vegetables.",
      "time_minutes": 30,
      "difficulty": "medium",
      "ingredients": [
        {
          "item": "2 piece medium sized tomato (diced into small cubes)",
          "name": "2 piece medium sized tomato (diced into small cubes)",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "2 oz carrot (cut into thin strips)",
          "name": "2 oz carrot (cut into thin strips)",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "2 oz seafood mushroom (roots removed, stems cut in half)",
          "name": "2 oz seafood mushroom (roots removed, stems cut in half)",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "2 oz king oyster mushroom (cut into little strips)",
          "name": "2 oz king oyster mushroom (cut into little strips)",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "3 piece shiitake mushroom (cut into thin slices)",
          "name": "3 piece shiitake mushroom (cut into thin slices)",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "0.25 oz dried wood ear mushroom (rehydrated and cut into thin slices)",
          "name": "0.25 oz dried wood ear mushroom (rehydrated and cut into thin slices)",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "2 piece egg (beaten)",
          "name": "2 piece egg (beaten)",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "1 oz red bell pepper (approx. half a pepper, cut into thin strips)",
          "name": "1 oz red bell pepper (approx. half a pepper, cut into thin strips)",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "2 piece green onion (minced)",
          "name": "2 piece green onion (minced)",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "2 piece dried chili peppers (optional)",
          "name": "2 piece dried chili peppers (optional)",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "14 oz firm tofu (cut into thin strips)",
          "name": "14 oz firm tofu (cut into thin strips)",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "5 cup water (for soup base, boiling)",
          "name": "5 cup water (for soup base, boiling)",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "2 tbsp vinegar",
          "name": "2 tbsp vinegar",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "1 tsp white pepper",
          "name": "1 tsp white pepper",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "1 tsp salt",
          "name": "1 tsp salt",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "1 tbsp sugar",
          "name": "1 tbsp sugar",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "2 tbsp light soy sauce",
          "name": "2 tbsp light soy sauce",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "0.50 tbsp dark soy sauce",
          "name": "0.50 tbsp dark soy sauce",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "3 tbsp cornstarch",
          "name": "3 tbsp cornstarch",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "2 tbsp water (for cornstarch slurry)",
          "name": "2 tbsp water (for cornstarch slurry)",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "1 tsp sesame oil (or to taste)",
          "name": "1 tsp sesame oil (or to taste)",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "1 tbsp corn oil",
          "name": "1 tbsp corn oil",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        }
      ],
      "instructions": "1. Wash all vegetables. Prep ingredients by cutting 2 seafood mushrooms in half, slicing 2 oz king oyster mushrooms and 3 shiitake mushrooms into strips/slices, and cutting 14 oz tofu, 2 oz carrots, and 1 oz red bell pepper into thin strips. Mince 2 green onions and dice 2 tomatoes into small cubes.\n2. Rehydrate 0.25 oz dried wood ear mushrooms (and shiitake if dried) in warm water for 10 minutes, then slice thinly.\n3. In a small bowl, mix 3 tbsp cornstarch with 2 tbsp water to create a slurry. In a separate bowl, crack and beat 2 eggs.\n4. Bring 5 cups of water to a boil in advance to save time.\n5. Heat a wok on the highest heat setting. Add 1 tbsp corn oil and 2 dried chili peppers. Toss for 1 minute to infuse the oil, then remove and discard the chilies.\n6. Add the diced tomatoes to the wok and cook for 30-60 seconds.\n7. Pour in the 5 cups of boiling water. Add 1 tsp white pepper and stir for 15-30 seconds.\n8. Add 1 tsp salt, 1 tbsp sugar, 2 tbsp light soy sauce, and 0.50 tbsp dark soy sauce. Stir for 15-30 seconds.\n9. Add the prepared tofu, all mushrooms, carrots, and bell peppers (everything except green onions). Stir gently for 5-10 seconds.\n10. Cover the wok with a lid and bring the mixture to a boil (about 3-4 minutes).\n11. Uncover the wok. Give the cornstarch slurry a quick stir, then slowly pour it into the soup over 50-60 seconds while stirring constantly to thicken.\n12. Slowly pour the beaten eggs all around the wok over 20-30 seconds. Do not stir immediately to allow egg ribbons to form.\n13. Add 2 tbsp vinegar and 1 tsp sesame oil (to taste). Stir in the minced green onions and serve immediately.",
      "source": "Captured",
      "rating": 0,
      "cook_count": 0,
      "tags": [
        "captured"
      ],
      "id": "0b3ec9fa-6606-4f17-9cbf-b247745d1c96"
    },
    {
      "name": "Thyme and Lemon Leek and Butterball Potato Soup",
      "description": "A silky, plant-based soup featuring the natural creaminess of German Butterball potatoes enhanced with aromatic fresh thyme and a bright squeeze of fresh lemon juice.",
      "ingredients_available": "1 bunch leeks, 1.5 lbs German Butterball potatoes, 1 medium yellow onion, 1 bunch fresh parsley",
      "ingredients_needed": "4 cups vegetable broth, 1 tbsp lemon juice, 1 tsp fresh thyme leaves, 2 tbsp olive oil, 1 tsp salt, 1/2 tsp black pepper",
      "time_minutes": "45",
      "difficulty": "easy",
      "reason": "The white wine was removed and replaced with 1 tbsp of lemon juice to maintain the soup's acidity and brightness while keeping the recipe alcohol-free.",
      "instructions": "1. Clean 1 bunch leeks thoroughly and slice the white and light green parts; peel and chop 1.5 lbs German Butterball potatoes into 1-inch cubes.\n2. Sauté the sliced leeks and 1 diced yellow onion in 2 tbsp olive oil over medium heat for 8-10 minutes until soft but not browned.\n3. Add the cubed 1.5 lbs German Butterball potatoes, 4 cups vegetable broth, and 1 tsp fresh thyme leaves; bring to a boil.\n4. Reduce heat to low and simmer for 20-25 minutes until the potatoes are fork-tender.\n5. Use an immersion blender to puree the soup until completely smooth and creamy.\n6. Stir in 1 tbsp lemon juice, 1 tsp salt, and 1/2 tsp black pepper; garnish with 1/4 cup chopped fresh parsley before serving.",
      "id": "f74cc727-d851-4b96-a6f5-abcc939c2e44",
      "created_date": "2026-01-07T19:13:10.055126"
    },
    {
      "name": "Sheet Pan Roasted Root Vegetables with Parsley Gremolata",
      "description": "A hearty American-style harvest roast featuring a variety of root vegetables tossed in herbs and finished with a fresh parsley lemon zest topping.",
      "ingredients_available": "1 bag German Butterball Potatoes, 1 bunch Red Turnips, 1 bunch Carrots, 1 Yellow Onion, 1 bunch Parsley",
      "ingredients_needed": "1 head Garlic, 1 Lemon",
      "time_minutes": "45",
      "difficulty": "easy",
      "reason": "This uses the bulk of your root vegetables in a classic American preparation that highlights the sweetness of the carrots and turnips.",
      "instructions": "1. Preheat oven to 425°F.\n2. Scrub and chop 1 bag German Butterball Potatoes, 1 bunch Red Turnips, and 1 bunch Carrots into 1-inch chunks. Peel and wedge 1 Yellow Onion.\n3. Spread vegetables on a large sheet pan. Toss with 3 tablespoons olive oil, 1 teaspoon salt, 1/2 teaspoon black pepper, and 1 teaspoon dried thyme.\n4. Roast for 30-35 minutes, tossing halfway through, until vegetables are tender and browned.\n5. While roasting, finely chop 1 bunch Parsley and mix with 3 cloves minced Garlic and the zest of 1 Lemon.\n6. Remove pan from oven and toss the hot vegetables with the parsley mixture before serving.",
      "source": "Generated",
      "rating": 0,
      "cook_count": 0,
      "tags": [
        "vegetarian"
      ],
      "ingredients": [
        {
          "item": "1 bag German Butterball Potatoes",
          "name": "1 bag german butterball potatoes",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "available"
        },
        {
          "item": "1 bunch Red Turnips",
          "name": "1 bunch red turnips",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "available"
        },
        {
          "item": "1 bunch Carrots",
          "name": "1 bunch carrots",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "available"
        },
        {
          "item": "1 Yellow Onion",
          "name": "1 yellow onion",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "available"
        },
        {
          "item": "1 bunch Parsley",
          "name": "1 bunch parsley",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "available"
        },
        {
          "item": "1 head Garlic",
          "name": "1 head garlic",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        },
        {
          "item": "1 Lemon",
          "name": "1 lemon",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "needed"
        }
      ],
      "id": "9c974bec-23c2-4cd4-8eaf-b28b1e743908",
      "created_date": "2026-01-07T19:14:42.123667"
    },
    {
      "name": "Savoy Cabbage, Delicata Squash, and Kale Sabzi",
      "description": "A hearty and nutritious Indian dry curry featuring sweet delicata squash, earthy kale, and cabbage seasoned with a warming blend of traditional spices.",
      "ingredients_available": "1 unit Savoy Cabbage, 1 lb German Butterball Potatoes, 1 bunch Carrots, 1 unit Yellow Onion, 1 unit Delicata Squash, 1 bunch Kale",
      "ingredients_needed": "2 cloves Garlic, 1 inch Fresh Ginger, 2 units Green Chilies, 1 tsp Garam Masala, 1 tsp Coriander Powder, 1 tsp Amchur Powder",
      "time_minutes": "45",
      "difficulty": "easy",
      "reason": "I have incorporated the Delicata squash and kale into the cooking process, adjusting the timing to ensure the squash is tender. I also added coriander powder, garam masala, and amchur powder to enhance the authentic Indian flavor profile as requested.",
      "instructions": "1. Peel and cube 1 lb German Butterball Potatoes into 1-inch pieces. Slice 1 unit Delicata Squash into half-moons (half-inch thick), removing seeds but leaving the skin on. Shred 1 unit Savoy Cabbage into thin strips. Destem and roughly chop 1 bunch Kale. Finely dice 1 unit Yellow Onion and 2 units Carrots.\n2. Heat 3 tbsp vegetable oil in a large pan over medium heat. Add 1 tsp cumin seeds and allow them to sizzle for 30 seconds.\n3. Add the diced 1 unit Yellow Onion, 2 cloves minced garlic, and 1 inch grated ginger. Sauté for 5 minutes until the onion is soft and translucent.\n4. Add the cubed 1 lb potatoes, sliced 1 unit delicata squash, and diced 2 units carrots. Season with 1 tsp turmeric, 1 tsp coriander powder, and 1 tsp salt. Cover and cook for 12-15 minutes, stirring occasionally, until the squash and potatoes are nearly tender.\n5. Add the shredded 1 unit Savoy Cabbage and 2 units slit green chilies. Stir well and cook uncovered for 8 minutes, allowing the cabbage to soften.\n6. Stir in 1 tsp garam masala and 1 tsp amchur powder for a tangy finish. Add the chopped 1 bunch kale and stir for 2-3 minutes until the kale is wilted and vibrant green.\n7. Garnish with 1/2 cup chopped parsley and serve hot with flatbread.",
      "id": "9279e022-7858-4e9b-87b2-4bf91bca565d",
      "created_date": "2026-01-14T00:54:00.636138"
    },
    {
      "name": "Miso Oyster Mushroom and Butterball Potato Pasta",
      "description": "A hearty and savory vegetarian pasta featuring meaty oyster mushrooms and creamy Butterball potatoes tossed in a silky white miso butter sauce with charred negi and garlic.",
      "ingredients_available": "1 bunch Japanese negi scallions, 2 medium Butterball potatoes, 4 cloves garlic",
      "ingredients_needed": "1 lb oyster mushrooms, 1 lb fettuccine or pappardelle pasta, 3 tbsp white miso paste, 4 oz parmesan cheese, 4 tbsp unsalted butter",
      "time_minutes": "40",
      "difficulty": "medium",
      "reason": "Replaced Yukon Gold potatoes with Butterball potatoes and added 4 cloves of minced garlic to the aromatic base as requested.",
      "instructions": "1. Bring a large pot of salted water to a boil and cook 1 lb fettuccine pasta according to package directions until al dente; reserve 1 cup of starchy pasta water before draining.\n2. While pasta cooks, slice 1 bunch Japanese negi into 1-inch rounds, mince 4 cloves garlic, and dice 2 medium Butterball potatoes into small 1/2-inch cubes to ensure quick cooking.\n3. Shred 1 lb oyster mushrooms by hand into bite-sized strips.\n4. In a large skillet, heat 3 tbsp olive oil over medium-high heat; add 1 lb shredded oyster mushrooms and the diced 2 medium Butterball potatoes. Cook for 10-12 minutes, stirring occasionally, until the mushrooms are crispy and the potatoes are golden-brown and fork-tender.\n5. Add the 1 bunch sliced negi rounds to the skillet and sauté for 3 minutes; then add the 4 cloves minced garlic and sauté for an additional 1-2 minutes until the negi is charred and the garlic is fragrant.\n6. In a small bowl, whisk 3 tbsp white miso paste with 1/2 cup of the reserved warm pasta water until completely smooth.\n7. Lower the skillet heat to medium-low; add the cooked 1 lb pasta, the miso mixture, 4 tbsp unsalted butter, and 4 oz grated parmesan cheese.\n8. Toss vigorously for 2 minutes, adding more pasta water if needed, until a silky, emulsified sauce coats the noodles; season with black pepper to taste and serve immediately.",
      "id": "6c7bc25d-facf-4633-8496-10a4e6b383c1",
      "created_date": "2026-01-15T00:33:25.220139"
    },
    {
      "name": "Sheet Pan Autumn Root Vegetable Roast",
      "description": "A hearty, colorful medley of roasted root vegetables and squash tossed in a balsamic-herb glaze. This dish highlights the natural sweetness of the radishes and delicata squash.",
      "ingredients_available": "1 bunch Red Turnips, 1 Green Meat Radish, 1 Bordeaux Radish, 1 bunch Carrots, 1 Delicata Squash, 1 lb German Butterball Potatoes, 1 bunch Japanese Negi Scallions, 1 bunch Parsley",
      "ingredients_needed": "",
      "time_minutes": "50",
      "difficulty": "easy",
      "reason": "This recipe uses all your requested \"roast\" ingredients in a classic American preparation that celebrates the harvest.",
      "instructions": "1. Preheat oven to 400°F (200°C).\n2. Scrub and dice 1 lb German Butterball Potatoes and 1 bunch Carrots into 1-inch chunks.\n3. Slice 1 Delicata Squash in half, remove seeds, and cut into half-moons (no need to peel).\n4. Quarter 1 bunch Red Turnips, and dice 1 Green Meat Radish and 1 Bordeaux Radish into 1-inch cubes.\n5. Toss all vegetables on a large sheet pan with 3 tbsp olive oil, 1 tsp salt, 1/2 tsp black pepper, and 1 tsp dried thyme.\n6. Roast for 30-35 minutes until tender and browned.\n7. Slice 1 bunch Japanese Negi Scallions into 1-inch pieces and toss them onto the pan for the last 10 minutes of roasting.\n8. Garnish with 1/2 cup chopped fresh Parsley and a drizzle of balsamic vinegar before serving.",
      "source": "Generated",
      "rating": 0,
      "cook_count": 0,
      "tags": [
        "vegetarian"
      ],
      "ingredients": [
        {
          "item": "1 bunch Red Turnips",
          "name": "1 bunch red turnips",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "available"
        },
        {
          "item": "1 Green Meat Radish",
          "name": "1 green meat radish",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "available"
        },
        {
          "item": "1 Bordeaux Radish",
          "name": "1 bordeaux radish",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "available"
        },
        {
          "item": "1 bunch Carrots",
          "name": "1 bunch carrots",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "available"
        },
        {
          "item": "1 Delicata Squash",
          "name": "1 delicata squash",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "available"
        },
        {
          "item": "1 lb German Butterball Potatoes",
          "name": "1 lb german butterball potatoes",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "available"
        },
        {
          "item": "1 bunch Japanese Negi Scallions",
          "name": "1 bunch japanese negi scallions",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "available"
        },
        {
          "item": "1 bunch Parsley",
          "name": "1 bunch parsley",
          "quantity": null,
          "unit": null,
          "modifier": null,
          "status": "available"
        }
      ],
      "id": "1a5aae3e-cdb6-4a0d-934d-dfeb7fe06294",
      "created_date": "2026-01-20T00:01:50.716060"
    }
  ]
}